kicer/ksloop/bsp/inc/hc32l110c4.h
typedef struct
{
    uint8_t RESERVED0[4];
    union
    {
        __IO uint32_t CR0;
        stc_adc_cr0_field_t CR0_f;
    };
    union
    {
        __IO uint32_t CR1;
        stc_adc_cr1_field_t CR1_f;
    };
    union
    {
        __IO uint32_t CR2;
        stc_adc_cr2_field_t CR2_f;
    };
    uint8_t RESERVED3[32];
    union
    {
        __IO uint32_t RESULT0;
        stc_adc_result0_field_t RESULT0_f;
    };
    union
    {
        __IO uint32_t RESULT1;
        stc_adc_result1_field_t RESULT1_f;
    };
    union
    {
        __IO uint32_t RESULT2;
        stc_adc_result2_field_t RESULT2_f;
    };
    union
    {
        __IO uint32_t RESULT3;
        stc_adc_result3_field_t RESULT3_f;
    };
    union
    {
        __IO uint32_t RESULT4;
        stc_adc_result4_field_t RESULT4_f;
    };
    union
    {
        __IO uint32_t RESULT5;
        stc_adc_result5_field_t RESULT5_f;
    };
    union
    {
        __IO uint32_t RESULT6;
        stc_adc_result6_field_t RESULT6_f;
    };
    union
    {
        __IO uint32_t RESULT7;
        stc_adc_result7_field_t RESULT7_f;
    };
    union
    {
        __IO uint32_t RESULT8;
        stc_adc_result8_field_t RESULT8_f;
    };
    union
    {
        __IO uint32_t RESULT_ACC;
        stc_adc_result_acc_field_t RESULT_ACC_f;
    };
    union
    {
        __IO uint32_t HT;
        stc_adc_ht_field_t HT_f;
    };
    union
    {
        __IO uint32_t LT;
        stc_adc_lt_field_t LT_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_adc_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICLR;
        stc_adc_iclr_field_t ICLR_f;
    };
    union
    {
        __IO uint32_t RESULT;
        stc_adc_result_field_t RESULT_f;
    };
}M0P_ADC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CNTER;
        stc_adt_cnter_field_t CNTER_f;
    };
    union
    {
        __IO uint32_t PERAR;
        stc_adt_perar_field_t PERAR_f;
    };
    union
    {
        __IO uint32_t PERBR;
        stc_adt_perbr_field_t PERBR_f;
    };
    uint8_t RESERVED3[4];
    union
    {
        __IO uint32_t GCMAR;
        stc_adt_gcmar_field_t GCMAR_f;
    };
    union
    {
        __IO uint32_t GCMBR;
        stc_adt_gcmbr_field_t GCMBR_f;
    };
    union
    {
        __IO uint32_t GCMCR;
        stc_adt_gcmcr_field_t GCMCR_f;
    };
    union
    {
        __IO uint32_t GCMDR;
        stc_adt_gcmdr_field_t GCMDR_f;
    };
    uint8_t RESERVED7[32];
    union
    {
        __IO uint32_t DTUAR;
        stc_adt_dtuar_field_t DTUAR_f;
    };
    union
    {
        __IO uint32_t DTDAR;
        stc_adt_dtdar_field_t DTDAR_f;
    };
    uint8_t RESERVED9[8];
    union
    {
        __IO uint32_t GCONR;
        stc_adt_gconr_field_t GCONR_f;
    };
    union
    {
        __IO uint32_t ICONR;
        stc_adt_iconr_field_t ICONR_f;
    };
    union
    {
        __IO uint32_t PCONR;
        stc_adt_pconr_field_t PCONR_f;
    };
    union
    {
        __IO uint32_t BCONR;
        stc_adt_bconr_field_t BCONR_f;
    };
    union
    {
        __IO uint32_t DCONR;
        stc_adt_dconr_field_t DCONR_f;
    };
    uint8_t RESERVED14[4];
    union
    {
        __IO uint32_t FCONR;
        stc_adt_fconr_field_t FCONR_f;
    };
    union
    {
        __IO uint32_t VPERR;
        stc_adt_vperr_field_t VPERR_f;
    };
    union
    {
        __IO uint32_t STFLR;
        stc_adt_stflr_field_t STFLR_f;
    };
    union
    {
        __IO uint32_t HSTAR;
        stc_adt_hstar_field_t HSTAR_f;
    };
    union
    {
        __IO uint32_t HSTPR;
        stc_adt_hstpr_field_t HSTPR_f;
    };
    union
    {
        __IO uint32_t HCELR;
        stc_adt_hcelr_field_t HCELR_f;
    };
    union
    {
        __IO uint32_t HCPAR;
        stc_adt_hcpar_field_t HCPAR_f;
    };
    union
    {
        __IO uint32_t HCPBR;
        stc_adt_hcpbr_field_t HCPBR_f;
    };
    union
    {
        __IO uint32_t HCUPR;
        stc_adt_hcupr_field_t HCUPR_f;
    };
    union
    {
        __IO uint32_t HCDOR;
        stc_adt_hcdor_field_t HCDOR_f;
    };
    uint8_t RESERVED24[112];
    union
    {
        __IO uint32_t IFR;
        stc_adt_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICLR;
        stc_adt_iclr_field_t ICLR_f;
    };
    union
    {
        __IO uint32_t CR;
        stc_adt_cr_field_t CR_f;
    };
    uint8_t RESERVED27[4];
    union
    {
        __IO uint32_t AOSSR;
        stc_adt_aossr_field_t AOSSR_f;
    };
    union
    {
        __IO uint32_t AOSCL;
        stc_adt_aoscl_field_t AOSCL_f;
    };
    union
    {
        __IO uint32_t PTBKS;
        stc_adt_ptbks_field_t PTBKS_f;
    };
    union
    {
        __IO uint32_t TTRIG;
        stc_adt_ttrig_field_t TTRIG_f;
    };
    union
    {
        __IO uint32_t ITRIG;
        stc_adt_itrig_field_t ITRIG_f;
    };
    union
    {
        __IO uint32_t PTBKP;
        stc_adt_ptbkp_field_t PTBKP_f;
    };
    uint8_t RESERVED33[716];
    union
    {
        __IO uint32_t SSTAR;
        stc_adt_sstar_field_t SSTAR_f;
    };
    union
    {
        __IO uint32_t SSTPR;
        stc_adt_sstpr_field_t SSTPR_f;
    };
    union
    {
        __IO uint32_t SCLRR;
        stc_adt_sclrr_field_t SCLRR_f;
    };
}M0P_ADT_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_bgr_cr_field_t CR_f;
    };
}M0P_BGR_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t ARR;
        stc_bt_arr_field_t ARR_f;
    };
    union
    {
        __IO uint32_t CNT;
        stc_bt_cnt_field_t CNT_f;
    };
    union
    {
        __IO uint32_t CNT32;
        stc_bt_cnt32_field_t CNT32_f;
    };
    union
    {
        __IO uint32_t CR;
        stc_bt_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_bt_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICLR;
        stc_bt_iclr_field_t ICLR_f;
    };
}M0P_BT_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_clk_trim_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t REFCON;
        stc_clk_trim_refcon_field_t REFCON_f;
    };
    union
    {
        __IO uint32_t REFCNT;
        stc_clk_trim_refcnt_field_t REFCNT_f;
    };
    union
    {
        __IO uint32_t CALCNT;
        stc_clk_trim_calcnt_field_t CALCNT_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_clk_trim_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICLR;
        stc_clk_trim_iclr_field_t ICLR_f;
    };
    union
    {
        __IO uint32_t CALCON;
        stc_clk_trim_calcon_field_t CALCON_f;
    };
}M0P_CLK_TRIM_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t SYSCTRL0;
        stc_clock_sysctrl0_field_t SYSCTRL0_f;
    };
    union
    {
        __IO uint32_t SYSCTRL1;
        stc_clock_sysctrl1_field_t SYSCTRL1_f;
    };
    union
    {
        __IO uint32_t SYSCTRL2;
        stc_clock_sysctrl2_field_t SYSCTRL2_f;
    };
    union
    {
        __IO uint32_t RCH_CR;
        stc_clock_rch_cr_field_t RCH_CR_f;
    };
    union
    {
        __IO uint32_t XTH_CR;
        stc_clock_xth_cr_field_t XTH_CR_f;
    };
    union
    {
        __IO uint32_t RCL_CR;
        stc_clock_rcl_cr_field_t RCL_CR_f;
    };
    union
    {
        __IO uint32_t XTL_CR;
        stc_clock_xtl_cr_field_t XTL_CR_f;
    };
    uint8_t RESERVED7[4];
    union
    {
        __IO uint32_t PERI_CLKEN;
        stc_clock_peri_clken_field_t PERI_CLKEN_f;
    };
    uint8_t RESERVED8[16];
    union
    {
        __IO uint32_t SYSTICK_CR;
        stc_clock_systick_cr_field_t SYSTICK_CR_f;
    };
    union
    {
        __IO uint32_t DEBUG_ACTIVE;
        stc_clock_debug_active_field_t DEBUG_ACTIVE_f;
    };
}M0P_CLOCK_TypeDef;

typedef struct
{
    uint8_t RESERVED0[4];
    union
    {
        __IO uint32_t RESULT;
        stc_crc_result_field_t RESULT_f;
    };
    uint8_t RESERVED1[120];
    union
    {
        __IO uint32_t DATA;
        stc_crc_data_field_t DATA_f;
    };
}M0P_CRC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t TNVS;
        stc_flash_tnvs_field_t TNVS_f;
    };
    union
    {
        __IO uint32_t TPGS;
        stc_flash_tpgs_field_t TPGS_f;
    };
    union
    {
        __IO uint32_t TPROG;
        stc_flash_tprog_field_t TPROG_f;
    };
    union
    {
        __IO uint32_t TSERASE;
        stc_flash_tserase_field_t TSERASE_f;
    };
    union
    {
        __IO uint32_t TMERASE;
        stc_flash_tmerase_field_t TMERASE_f;
    };
    union
    {
        __IO uint32_t TPRCV;
        stc_flash_tprcv_field_t TPRCV_f;
    };
    union
    {
        __IO uint32_t TSRCV;
        stc_flash_tsrcv_field_t TSRCV_f;
    };
    union
    {
        __IO uint32_t TMRCV;
        stc_flash_tmrcv_field_t TMRCV_f;
    };
    union
    {
        __IO uint32_t CR;
        stc_flash_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_flash_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICLR;
        stc_flash_iclr_field_t ICLR_f;
    };
    union
    {
        __IO uint32_t BYPASS;
        stc_flash_bypass_field_t BYPASS_f;
    };
    union
    {
        __IO uint32_t SLOCK;
        stc_flash_slock_field_t SLOCK_f;
    };
}M0P_FLASH_TypeDef;

typedef struct
{
    uint8_t RESERVED0[4];
    union
    {
        __IO uint32_t P01_SEL;
        stc_gpio_p01_sel_field_t P01_SEL_f;
    };
    union
    {
        __IO uint32_t P02_SEL;
        stc_gpio_p02_sel_field_t P02_SEL_f;
    };
    union
    {
        __IO uint32_t P03_SEL;
        stc_gpio_p03_sel_field_t P03_SEL_f;
    };
    uint8_t RESERVED3[64];
    union
    {
        __IO uint32_t P14_SEL;
        stc_gpio_p14_sel_field_t P14_SEL_f;
    };
    union
    {
        __IO uint32_t P15_SEL;
        stc_gpio_p15_sel_field_t P15_SEL_f;
    };
    uint8_t RESERVED5[52];
    union
    {
        __IO uint32_t P23_SEL;
        stc_gpio_p23_sel_field_t P23_SEL_f;
    };
    union
    {
        __IO uint32_t P24_SEL;
        stc_gpio_p24_sel_field_t P24_SEL_f;
    };
    union
    {
        __IO uint32_t P25_SEL;
        stc_gpio_p25_sel_field_t P25_SEL_f;
    };
    union
    {
        __IO uint32_t P26_SEL;
        stc_gpio_p26_sel_field_t P26_SEL_f;
    };
    union
    {
        __IO uint32_t P27_SEL;
        stc_gpio_p27_sel_field_t P27_SEL_f;
    };
    uint8_t RESERVED10[36];
    union
    {
        __IO uint32_t P31_SEL;
        stc_gpio_p31_sel_field_t P31_SEL_f;
    };
    union
    {
        __IO uint32_t P32_SEL;
        stc_gpio_p32_sel_field_t P32_SEL_f;
    };
    union
    {
        __IO uint32_t P33_SEL;
        stc_gpio_p33_sel_field_t P33_SEL_f;
    };
    union
    {
        __IO uint32_t P34_SEL;
        stc_gpio_p34_sel_field_t P34_SEL_f;
    };
    union
    {
        __IO uint32_t P35_SEL;
        stc_gpio_p35_sel_field_t P35_SEL_f;
    };
    union
    {
        __IO uint32_t P36_SEL;
        stc_gpio_p36_sel_field_t P36_SEL_f;
    };
    uint8_t RESERVED16[36];
    union
    {
        __IO uint32_t P0DIR;
        stc_gpio_p0dir_field_t P0DIR_f;
    };
    union
    {
        __IO uint32_t P0IN;
        stc_gpio_p0in_field_t P0IN_f;
    };
    union
    {
        __IO uint32_t P0OUT;
        stc_gpio_p0out_field_t P0OUT_f;
    };
    union
    {
        __IO uint32_t P0ADS;
        stc_gpio_p0ads_field_t P0ADS_f;
    };
    uint8_t RESERVED20[12];
    union
    {
        __IO uint32_t P0DR;
        stc_gpio_p0dr_field_t P0DR_f;
    };
    union
    {
        __IO uint32_t P0PU;
        stc_gpio_p0pu_field_t P0PU_f;
    };
    union
    {
        __IO uint32_t P0PD;
        stc_gpio_p0pd_field_t P0PD_f;
    };
    uint8_t RESERVED23[4];
    union
    {
        __IO uint32_t P0OD;
        stc_gpio_p0od_field_t P0OD_f;
    };
    union
    {
        __IO uint32_t P0HIE;
        stc_gpio_p0hie_field_t P0HIE_f;
    };
    union
    {
        __IO uint32_t P0LIE;
        stc_gpio_p0lie_field_t P0LIE_f;
    };
    union
    {
        __IO uint32_t P0RIE;
        stc_gpio_p0rie_field_t P0RIE_f;
    };
    union
    {
        __IO uint32_t P0FIE;
        stc_gpio_p0fie_field_t P0FIE_f;
    };
    union
    {
        __IO uint32_t P1DIR;
        stc_gpio_p1dir_field_t P1DIR_f;
    };
    union
    {
        __IO uint32_t P1IN;
        stc_gpio_p1in_field_t P1IN_f;
    };
    union
    {
        __IO uint32_t P1OUT;
        stc_gpio_p1out_field_t P1OUT_f;
    };
    union
    {
        __IO uint32_t P1ADS;
        stc_gpio_p1ads_field_t P1ADS_f;
    };
    uint8_t RESERVED32[12];
    union
    {
        __IO uint32_t P1DR;
        stc_gpio_p1dr_field_t P1DR_f;
    };
    union
    {
        __IO uint32_t P1PU;
        stc_gpio_p1pu_field_t P1PU_f;
    };
    union
    {
        __IO uint32_t P1PD;
        stc_gpio_p1pd_field_t P1PD_f;
    };
    uint8_t RESERVED35[4];
    union
    {
        __IO uint32_t P1OD;
        stc_gpio_p1od_field_t P1OD_f;
    };
    union
    {
        __IO uint32_t P1HIE;
        stc_gpio_p1hie_field_t P1HIE_f;
    };
    union
    {
        __IO uint32_t P1LIE;
        stc_gpio_p1lie_field_t P1LIE_f;
    };
    union
    {
        __IO uint32_t P1RIE;
        stc_gpio_p1rie_field_t P1RIE_f;
    };
    union
    {
        __IO uint32_t P1FIE;
        stc_gpio_p1fie_field_t P1FIE_f;
    };
    union
    {
        __IO uint32_t P2DIR;
        stc_gpio_p2dir_field_t P2DIR_f;
    };
    union
    {
        __IO uint32_t P2IN;
        stc_gpio_p2in_field_t P2IN_f;
    };
    union
    {
        __IO uint32_t P2OUT;
        stc_gpio_p2out_field_t P2OUT_f;
    };
    union
    {
        __IO uint32_t P2ADS;
        stc_gpio_p2ads_field_t P2ADS_f;
    };
    uint8_t RESERVED44[12];
    union
    {
        __IO uint32_t P2DR;
        stc_gpio_p2dr_field_t P2DR_f;
    };
    union
    {
        __IO uint32_t P2PU;
        stc_gpio_p2pu_field_t P2PU_f;
    };
    union
    {
        __IO uint32_t P2PD;
        stc_gpio_p2pd_field_t P2PD_f;
    };
    uint8_t RESERVED47[4];
    union
    {
        __IO uint32_t P2OD;
        stc_gpio_p2od_field_t P2OD_f;
    };
    union
    {
        __IO uint32_t P2HIE;
        stc_gpio_p2hie_field_t P2HIE_f;
    };
    union
    {
        __IO uint32_t P2LIE;
        stc_gpio_p2lie_field_t P2LIE_f;
    };
    union
    {
        __IO uint32_t P2RIE;
        stc_gpio_p2rie_field_t P2RIE_f;
    };
    union
    {
        __IO uint32_t P2FIE;
        stc_gpio_p2fie_field_t P2FIE_f;
    };
    union
    {
        __IO uint32_t P3DIR;
        stc_gpio_p3dir_field_t P3DIR_f;
    };
    union
    {
        __IO uint32_t P3IN;
        stc_gpio_p3in_field_t P3IN_f;
    };
    union
    {
        __IO uint32_t P3OUT;
        stc_gpio_p3out_field_t P3OUT_f;
    };
    union
    {
        __IO uint32_t P3ADS;
        stc_gpio_p3ads_field_t P3ADS_f;
    };
    uint8_t RESERVED56[12];
    union
    {
        __IO uint32_t P3DR;
        stc_gpio_p3dr_field_t P3DR_f;
    };
    union
    {
        __IO uint32_t P3PU;
        stc_gpio_p3pu_field_t P3PU_f;
    };
    union
    {
        __IO uint32_t P3PD;
        stc_gpio_p3pd_field_t P3PD_f;
    };
    uint8_t RESERVED59[4];
    union
    {
        __IO uint32_t P3OD;
        stc_gpio_p3od_field_t P3OD_f;
    };
    union
    {
        __IO uint32_t P3HIE;
        stc_gpio_p3hie_field_t P3HIE_f;
    };
    union
    {
        __IO uint32_t P3LIE;
        stc_gpio_p3lie_field_t P3LIE_f;
    };
    union
    {
        __IO uint32_t P3RIE;
        stc_gpio_p3rie_field_t P3RIE_f;
    };
    union
    {
        __IO uint32_t P3FIE;
        stc_gpio_p3fie_field_t P3FIE_f;
    };
    union
    {
        __IO uint32_t P0STAT;
        stc_gpio_p0stat_field_t P0STAT_f;
    };
    uint8_t RESERVED65[12];
    union
    {
        __IO uint32_t P0ICLR;
        stc_gpio_p0iclr_field_t P0ICLR_f;
    };
    uint8_t RESERVED66[44];
    union
    {
        __IO uint32_t P1STAT;
        stc_gpio_p1stat_field_t P1STAT_f;
    };
    uint8_t RESERVED67[12];
    union
    {
        __IO uint32_t P1ICLR;
        stc_gpio_p1iclr_field_t P1ICLR_f;
    };
    uint8_t RESERVED68[44];
    union
    {
        __IO uint32_t P2STAT;
        stc_gpio_p2stat_field_t P2STAT_f;
    };
    uint8_t RESERVED69[12];
    union
    {
        __IO uint32_t P2ICLR;
        stc_gpio_p2iclr_field_t P2ICLR_f;
    };
    uint8_t RESERVED70[44];
    union
    {
        __IO uint32_t P3STAT;
        stc_gpio_p3stat_field_t P3STAT_f;
    };
    uint8_t RESERVED71[12];
    union
    {
        __IO uint32_t P3ICLR;
        stc_gpio_p3iclr_field_t P3ICLR_f;
    };
    uint8_t RESERVED72[44];
    union
    {
        __IO uint32_t CTRL0;
        stc_gpio_ctrl0_field_t CTRL0_f;
    };
    union
    {
        __IO uint32_t CTRL1;
        stc_gpio_ctrl1_field_t CTRL1_f;
    };
    union
    {
        __IO uint32_t CTRL2;
        stc_gpio_ctrl2_field_t CTRL2_f;
    };
    union
    {
        __IO uint32_t CTRL3;
        stc_gpio_ctrl3_field_t CTRL3_f;
    };
    union
    {
        __IO uint32_t CTRL4;
        stc_gpio_ctrl4_field_t CTRL4_f;
    };
}M0P_GPIO_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t TMRUN;
        stc_i2c_tmrun_field_t TMRUN_f;
    };
    union
    {
        __IO uint32_t TM;
        stc_i2c_tm_field_t TM_f;
    };
    union
    {
        __IO uint32_t CR;
        stc_i2c_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t DATA;
        stc_i2c_data_field_t DATA_f;
    };
    union
    {
        __IO uint32_t ADDR;
        stc_i2c_addr_field_t ADDR_f;
    };
    union
    {
        __IO uint32_t STAT;
        stc_i2c_stat_field_t STAT_f;
    };
}M0P_I2C_TypeDef;

typedef struct
{
    uint8_t RESERVED0[96];
    union
    {
        __IO uint32_t CNT;
        stc_lptimer_cnt_field_t CNT_f;
    };
    union
    {
        __IO uint32_t ARR;
        stc_lptimer_arr_field_t ARR_f;
    };
    uint8_t RESERVED2[4];
    union
    {
        __IO uint32_t CR;
        stc_lptimer_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_lptimer_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICLR;
        stc_lptimer_iclr_field_t ICLR_f;
    };
}M0P_LPTIMER_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t SBUF;
        stc_lpuart_sbuf_field_t SBUF_f;
    };
    union
    {
        __IO uint32_t SCON;
        stc_lpuart_scon_field_t SCON_f;
    };
    union
    {
        __IO uint32_t SADDR;
        stc_lpuart_saddr_field_t SADDR_f;
    };
    union
    {
        __IO uint32_t SADEN;
        stc_lpuart_saden_field_t SADEN_f;
    };
    union
    {
        __IO uint32_t ISR;
        stc_lpuart_isr_field_t ISR_f;
    };
    union
    {
        __IO uint32_t ICR;
        stc_lpuart_icr_field_t ICR_f;
    };
}M0P_LPUART_TypeDef;

typedef struct
{
    uint8_t RESERVED0[40];
    union
    {
        __IO uint32_t CR;
        stc_lvd_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_lvd_ifr_field_t IFR_f;
    };
}M0P_LVD_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CCON;
        stc_pca_ccon_field_t CCON_f;
    };
    union
    {
        __IO uint32_t CMOD;
        stc_pca_cmod_field_t CMOD_f;
    };
    union
    {
        __IO uint32_t CNT;
        stc_pca_cnt_field_t CNT_f;
    };
    union
    {
        __IO uint32_t ICLR;
        stc_pca_iclr_field_t ICLR_f;
    };
    union
    {
        __IO uint32_t CCAPM0;
        stc_pca_ccapm0_field_t CCAPM0_f;
    };
    union
    {
        __IO uint32_t CCAPM1;
        stc_pca_ccapm1_field_t CCAPM1_f;
    };
    union
    {
        __IO uint32_t CCAPM2;
        stc_pca_ccapm2_field_t CCAPM2_f;
    };
    union
    {
        __IO uint32_t CCAPM3;
        stc_pca_ccapm3_field_t CCAPM3_f;
    };
    union
    {
        __IO uint32_t CCAPM4;
        stc_pca_ccapm4_field_t CCAPM4_f;
    };
    union
    {
        __IO uint32_t CCAP0H;
        stc_pca_ccap0h_field_t CCAP0H_f;
    };
    union
    {
        __IO uint32_t CCAP0L;
        stc_pca_ccap0l_field_t CCAP0L_f;
    };
    union
    {
        __IO uint32_t CCAP1H;
        stc_pca_ccap1h_field_t CCAP1H_f;
    };
    union
    {
        __IO uint32_t CCAP1L;
        stc_pca_ccap1l_field_t CCAP1L_f;
    };
    union
    {
        __IO uint32_t CCAP2H;
        stc_pca_ccap2h_field_t CCAP2H_f;
    };
    union
    {
        __IO uint32_t CCAP2L;
        stc_pca_ccap2l_field_t CCAP2L_f;
    };
    union
    {
        __IO uint32_t CCAP3H;
        stc_pca_ccap3h_field_t CCAP3H_f;
    };
    union
    {
        __IO uint32_t CCAP3L;
        stc_pca_ccap3l_field_t CCAP3L_f;
    };
    union
    {
        __IO uint32_t CCAP4H;
        stc_pca_ccap4h_field_t CCAP4H_f;
    };
    union
    {
        __IO uint32_t CCAP4L;
        stc_pca_ccap4l_field_t CCAP4L_f;
    };
    union
    {
        __IO uint32_t CCAPO;
        stc_pca_ccapo_field_t CCAPO_f;
    };
    union
    {
        __IO uint32_t CCAP0;
        stc_pca_ccap0_field_t CCAP0_f;
    };
    union
    {
        __IO uint32_t CCAP1;
        stc_pca_ccap1_field_t CCAP1_f;
    };
    union
    {
        __IO uint32_t CCAP2;
        stc_pca_ccap2_field_t CCAP2_f;
    };
    union
    {
        __IO uint32_t CCAP3;
        stc_pca_ccap3_field_t CCAP3_f;
    };
    union
    {
        __IO uint32_t CCAP4;
        stc_pca_ccap4_field_t CCAP4_f;
    };
}M0P_PCA_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_ram_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t ERRADDR;
        stc_ram_erraddr_field_t ERRADDR_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_ram_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICLR;
        stc_ram_iclr_field_t ICLR_f;
    };
}M0P_RAM_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t RESET_FLAG;
        stc_reset_flag_field_t RESET_FLAG_f;
    };
    uint8_t RESERVED1[8];
    union
    {
        __IO uint32_t PREI_RESET;
        stc_reset_prei_field_t PREI_RESET_f;
    };
}M0P_RESET_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR0;
        stc_rtc_cr0_field_t CR0_f;
    };
    union
    {
        __IO uint32_t CR1;
        stc_rtc_cr1_field_t CR1_f;
    };
    union
    {
        __IO uint32_t SEC;
        stc_rtc_sec_field_t SEC_f;
    };
    union
    {
        __IO uint32_t MIN;
        stc_rtc_min_field_t MIN_f;
    };
    union
    {
        __IO uint32_t HOUR;
        stc_rtc_hour_field_t HOUR_f;
    };
    union
    {
        __IO uint32_t WEEK;
        stc_rtc_week_field_t WEEK_f;
    };
    union
    {
        __IO uint32_t DAY;
        stc_rtc_day_field_t DAY_f;
    };
    union
    {
        __IO uint32_t MON;
        stc_rtc_mon_field_t MON_f;
    };
    union
    {
        __IO uint32_t YEAR;
        stc_rtc_year_field_t YEAR_f;
    };
    union
    {
        __IO uint32_t ALMMIN;
        stc_rtc_almmin_field_t ALMMIN_f;
    };
    union
    {
        __IO uint32_t ALMHOUR;
        stc_rtc_almhour_field_t ALMHOUR_f;
    };
    union
    {
        __IO uint32_t ALMWEEK;
        stc_rtc_almweek_field_t ALMWEEK_f;
    };
    union
    {
        __IO uint32_t COMPEN;
        stc_rtc_compen_field_t COMPEN_f;
    };
}M0P_RTC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_spi_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t SSN;
        stc_spi_ssn_field_t SSN_f;
    };
    union
    {
        __IO uint32_t STAT;
        stc_spi_stat_field_t STAT_f;
    };
    union
    {
        __IO uint32_t DATA;
        stc_spi_data_field_t DATA_f;
    };
}M0P_SPI_TypeDef;

