kicer/ksloop/bsp/inc/hc32l110c4.h
typedef struct
{
    union
    {
        __IO uint32_t SBUF;
        stc_uart_sbuf_field_t SBUF_f;
    };
    union
    {
        __IO uint32_t SCON;
        stc_uart_scon_field_t SCON_f;
    };
    union
    {
        __IO uint32_t SADDR;
        stc_uart_saddr_field_t SADDR_f;
    };
    union
    {
        __IO uint32_t SADEN;
        stc_uart_saden_field_t SADEN_f;
    };
    union
    {
        __IO uint32_t ISR;
        stc_uart_isr_field_t ISR_f;
    };
    union
    {
        __IO uint32_t ICR;
        stc_uart_icr_field_t ICR_f;
    };
}M0P_UART_TypeDef;

typedef struct
{
    uint8_t RESERVED0[16];
    union
    {
        __IO uint32_t CR;
        stc_vc_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t VC0_CR;
        stc_vc_vc0_cr_field_t VC0_CR_f;
    };
    union
    {
        __IO uint32_t VC1_CR;
        stc_vc_vc1_cr_field_t VC1_CR_f;
    };
    union
    {
        __IO uint32_t VC0_OUT_CFG;
        stc_vc_vc0_out_cfg_field_t VC0_OUT_CFG_f;
    };
    union
    {
        __IO uint32_t VC1_OUT_CFG;
        stc_vc_vc1_out_cfg_field_t VC1_OUT_CFG_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_vc_ifr_field_t IFR_f;
    };
}M0P_VC_TypeDef;

typedef struct
{
    uint8_t RESERVED0[128];
    union
    {
        __IO uint32_t RST;
        stc_wdt_rst_field_t RST_f;
    };
    union
    {
        __IO uint32_t CON;
        stc_wdt_con_field_t CON_f;
    };
}M0P_WDT_TypeDef;



#define M0P_PERIPH_BASE                        (0x40000000UL)
#define M0P_ADC_BASE                           (M0P_PERIPH_BASE + 0x00002400UL)
#define M0P_ADT0_BASE                          (M0P_PERIPH_BASE + 0x00003000UL)
#define M0P_ADT1_BASE                          (M0P_PERIPH_BASE + 0x00003400UL)
#define M0P_ADT2_BASE                          (M0P_PERIPH_BASE + 0x00003800UL)
#define M0P_BGR_BASE                           (M0P_PERIPH_BASE + 0x00002400UL)
#define M0P_BT0_BASE                           (M0P_PERIPH_BASE + 0x00000C00UL)
#define M0P_BT1_BASE                           (M0P_PERIPH_BASE + 0x00000C20UL)
#define M0P_BT2_BASE                           (M0P_PERIPH_BASE + 0x00000C40UL)
#define M0P_CLK_TRIM_BASE                      (M0P_PERIPH_BASE + 0x00001800UL)
#define M0P_CLOCK_BASE                         (M0P_PERIPH_BASE + 0x00002000UL)
#define M0P_CRC_BASE                           (M0P_PERIPH_BASE + 0x00020900UL)
#define M0P_FLASH_BASE                         (M0P_PERIPH_BASE + 0x00020000UL)
#define M0P_GPIO_BASE                          (M0P_PERIPH_BASE + 0x00020C00UL)
#define M0P_I2C_BASE                           (M0P_PERIPH_BASE + 0x00000400UL)
#define M0P_LPTIMER_BASE                       (M0P_PERIPH_BASE + 0x00000C00UL)
#define M0P_LPUART_BASE                        (M0P_PERIPH_BASE + 0x00000200UL)
#define M0P_LVD_BASE                           (M0P_PERIPH_BASE + 0x00002400UL)
#define M0P_PCA_BASE                           (M0P_PERIPH_BASE + 0x00001000UL)
#define M0P_RAM_BASE                           (M0P_PERIPH_BASE + 0x00020400UL)
#define M0P_RESET_BASE                         (M0P_PERIPH_BASE + 0x0000201CUL)
#define M0P_RTC_BASE                           (M0P_PERIPH_BASE + 0x00001400UL)
#define M0P_SPI_BASE                           (M0P_PERIPH_BASE + 0x00000800UL)
#define M0P_UART0_BASE                         (M0P_PERIPH_BASE + 0x00000000UL)
#define M0P_UART1_BASE                         (M0P_PERIPH_BASE + 0x00000100UL)
#define M0P_VC_BASE                            (M0P_PERIPH_BASE + 0x00002400UL)
#define M0P_WDT_BASE                           (M0P_PERIPH_BASE + 0x00000C00UL)


#define M0P_ADC                                ((M0P_ADC_TypeDef *)0x40002400UL)
#define M0P_ADT0                               ((M0P_ADT_TypeDef *)0x40003000UL)
#define M0P_ADT1                               ((M0P_ADT_TypeDef *)0x40003400UL)
#define M0P_ADT2                               ((M0P_ADT_TypeDef *)0x40003800UL)
#define M0P_BGR                                ((M0P_BGR_TypeDef *)0x40002400UL)
#define M0P_BT0                                ((M0P_BT_TypeDef *)0x40000C00UL)
#define M0P_BT1                                ((M0P_BT_TypeDef *)0x40000C20UL)
#define M0P_BT2                                ((M0P_BT_TypeDef *)0x40000C40UL)
#define M0P_CLK_TRIM                           ((M0P_CLK_TRIM_TypeDef *)0x40001800UL)
#define M0P_CLOCK                              ((M0P_CLOCK_TypeDef *)0x40002000UL)
#define M0P_CRC                                ((M0P_CRC_TypeDef *)0x40020900UL)
#define M0P_FLASH                              ((M0P_FLASH_TypeDef *)0x40020000UL)
#define M0P_GPIO                               ((M0P_GPIO_TypeDef *)0x40020C00UL)
#define M0P_I2C                                ((M0P_I2C_TypeDef *)0x40000400UL)
#define M0P_LPTIMER                            ((M0P_LPTIMER_TypeDef *)0x40000C00UL)
#define M0P_LPUART                             ((M0P_LPUART_TypeDef *)0x40000200UL)
#define M0P_LVD                                ((M0P_LVD_TypeDef *)0x40002400UL)
#define M0P_PCA                                ((M0P_PCA_TypeDef *)0x40001000UL)
#define M0P_RAM                                ((M0P_RAM_TypeDef *)0x40020400UL)
#define M0P_RESET                              ((M0P_RESET_TypeDef *)0x4000201CUL)
#define M0P_RTC                                ((M0P_RTC_TypeDef *)0x40001400UL)
#define M0P_SPI                                ((M0P_SPI_TypeDef *)0x40000800UL)
#define M0P_UART0                              ((M0P_UART_TypeDef *)0x40000000UL)
#define M0P_UART1                              ((M0P_UART_TypeDef *)0x40000100UL)
#define M0P_VC                                 ((M0P_VC_TypeDef *)0x40002400UL)
#define M0P_WDT                                ((M0P_WDT_TypeDef *)0x40000C00UL)


#ifdef __cplusplus
}
#endif

#endif /* __HC32L110CX_H__ */

